{
    "yliasdiscordbothx": {
        "bot": {
            "new": {
                "helpdialogintroduction": [
                    "Salut ! Je suis **Ylias**, un métamorphe qui veut aider ! Voici une liste des commandes auxquelles je peux répondre :"
                ],
                "helpdialogend": [
                    "Comme vous pouvez le voir, certaines commandes peuvent prendre des paramètres. Un paramètre est indiqué par un groupe de parenthèses. Lorsque vous tapperez la commande, il ne faut pas reporter ces parenthèses. Si vous voyez des paramètres en *italique*, ça signifie qu'ils sont optionnels. Si vous avez besoin de plus d'aide, demandez à **Lily Wonhalf**. C'est elle l'idiote qui m'a codé, elle devrait savoir."
                ]
            },
            "bindsignals": {
                "cleverbotio_bot_suspected": [
                    "**chuchote aux autres** Dîtes les gens... J'veux pas vous affoler, mais je crois que %% est un bot. Il répond beaucoup trop vite à mon goût..."
                ],
                "cleverbotio_not_ready": [
                    "Attends attends %%, j'ai même pas eu le temps de me réveiller correctement, Lily vient tout juste de me démarrer là... Je peux avoir un café s'il te plaît ?"
                ],
                "no_last_command": [
                    "%%, aucune commande n'a été exécutée sur ce canal depuis que je suis connecté. Désolé :/ ."
                ],
                "unauthorized_command_message_to_owner": [
                    "%% a essayé d'exécuter la commande %% avec les arguments \"%%\" alors qu'il n'a pas les droits. %%"
                ],
                "unauthorized_command_message_to_member": [
                    "Désolé, %%, tu n'as pas l'autorisation d'exécuter cette commande."
                ],
                "unknown_command": [
                    "%% ? Je ne connais pas cette commande, désolé, %%... Tu peux voir la liste des commandes en tapant %%help :) ."
                ],
                "check_permission_error": [
                    "Désolé %%, il y a eu un problème durant la récupération de tes permissions."
                ],
                "get_denied_command_list_error": [
                    "Désolé %%, il y a eu un problème durant la récupération de la liste."
                ],
                "help_dialog_sent_confirmation": [
                    "Je viens juste de t'envoyer par MP la liste des commandes auxquelles je peux répondre, %%."
                ],
                "help_dialog_send_error": [
                    "Désolé %%, une erreur est survenue durant l'envoi du message d'aide."
                ]
            }
        },
        "event": {
            "clienteventhandler": {
                "servernewmemberhandler": {
                    "fail": [
                        "Le membre %% vient de rejoindre le serveur %%, mais je n'ai pas pu lui envoyer de message privé à cause d'une erreur de BDD... J'te laisse t'en charger ?"
                    ],
                    "notification_to_staff": [
                        "Le membre %% vient de rejoindre le serveur %% !"
                    ]
                },
                "servermemberremovedhandler": {
                    "notification_to_staff": [
                        "Le membre %% vient de quitter le serveur %% !"
                    ]
                }
            }
        },
        "model": {
            "commandlist": {
                "avatar": {
                    "description": [
                        "Permet d'afficher l'avatar d'un membre en plus grand"
                    ],
                    "not_found": [
                        "Désolé %%, mais je n'ai pas trouvé ce membre..."
                    ],
                    "client_avatar_author": [
                        "Mon avatar a été créé par Miago : %%"
                    ]
                },
                "aww": {
                    "description": [
                        "Affiche un AWW aléatoire"
                    ],
                    "fail": [
                        "Bon... Reddit a planté on dirait. Je suis désolé %% :( ..."
                    ]
                },
                "cat": {
                    "description": [
                        "Affiche un chat aléatoire"
                    ],
                    "fail": [
                        "Bon... random.cat a planté on dirait. Je suis désolé %% :( ..."
                    ]
                },
                "crash": {
                    "description": [
                        "Cette commande, elle me tue. Non mais... Littéralement, en fait"
                    ],
                    "speech": [
                        "Ah d'accord, donc t'en as marre de moi. D'accord. Tu crois vraiment que tu peux te débarrasser de moi comme ça ? Tu crois vraiment que c'est aussi facile ? Mais j'suis un malade moi ! Je peux traiter des paradoxes sans problème moi !\n\n\"Cette phrase est fausse.\""
                    ]
                },
                "decide": {
                    "description": [
                        "Vous n'arrivez pas à vous décider entre deux choses ? Je peux décider pour vous :D"
                    ],
                    "split": [
                        "ou"
                    ]
                },
                "deletewelcomemessage": {
                    "description": [
                        "Permet de supprimer le message de bienvenue d'un serveur"
                    ],
                    "not_found": [
                        "%%, Le message de bienvenue que tu me demandes de supprimer n'existe déjà pas. J'imagine que c'est une bonne nouvelle, non ?"
                    ],
                    "fail": [
                        "%%, Nope, ça n'a pas fonctionné : %%"
                    ],
                    "success": [
                        "%%, Compris, c'est supprimé !"
                    ]
                },
                "describe": {
                    "description": [
                        "Vous pouvez demander à un ordinateur comme moi de décrire une image !"
                    ]
                },
                "dog": {
                    "description": [
                        "Affiche un chien aléatoire"
                    ],
                    "fail": [
                        "Bon... random.dog a planté on dirait. Je suis désolé %% :( ..."
                    ]
                },
                "eval": {
                    "description": [
                        "Permet d'exécuter des commandes javascript et d'afficher le retour"
                    ]
                },
                "getty": {
                    "description": [
                        "Affiche une image aléatoire"
                    ],
                    "not_found": [
                        "Bon... On dirait que ta recherche ne donne aucun résultat. Je suis désolé %% :( ..."
                    ],
                    "fail": [
                        "Bon... l'API de Getty a planté on dirait. Je suis désolé %% :( ..."
                    ]
                },
                "getwelcomemessage": {
                    "description": [
                        "Permet de voir le message de bienvenue qui sera envoyé par message privé aux personnes qui rejoindront ce salon"
                    ],
                    "fail": [
                        "%%, Nope, ça n'a pas fonctionné : %%"
                    ],
                    "success": [
                        "%%, Le message de bienvenue pour ce serveur est le suivant :\n\n%%"
                    ],
                    "not_found": [
                        "%%, Je n'ai pas trouvé de message de bienvenue pour ce serveur"
                    ]
                },
                "hug": {
                    "description": [
                        "Tout le monde a besoin de tendresse à un moment ou à un autre. Hey, c'est pas parce que je suis un robot que je ne suis pas capable de démontrer de l'amour"
                    ],
                    "self_hug": {
                        "1": [
                            "**Se transforme en poulpe pour s'enlacer lui-même dans ses tentacules <3**"
                        ],
                        "2": [
                            "**Enroule ses pattes autour de son torse pour se faire un câlin à lui-même <3**"
                        ],
                        "3": [
                            "**Attrape un coussin, dessine son avatar dessus et lui fait un câlin <3**"
                        ]
                    },
                    "hug": {
                        "1": [
                            "**Prend l'apparence d'un renard blanc, avance discrètement dans les hautes herbes, se plaque au sol, remue la queue, et BONDIT sur %% pour lui faire un gros câlin !**"
                        ],
                        "2": [
                            "**Fait un câlin à %%**"
                        ],
                        "3": [
                            "Viens ici que je te fasse un câlin, %% ! **serre fort**"
                        ],
                        "4": [
                            "**Tombe d'une branche d'arbre pour faire un câlin à %%**"
                        ],
                        "5": [
                            "**Rampe discrètement dans un trou et jaillit de terre en prenant %% dans les bras**"
                        ],
                        "6": [
                            "**Se balance de liane en liane pour atterrir dans les bras de %%**"
                        ],
                        "7": [
                            "**Jette un ours en peluche criant \"HUG\" à la tête de %%**"
                        ],
                        "8": [
                            "**Se transforme en poulpe et agrippe %% avec ses tentacules**"
                        ],
                        "9": [
                            "**Se transforme en serpent et vient faire une étreinte à %%**"
                        ]
                    }
                },
                "imgur": {
                    "description": [
                        "Affiche une image aléatoire"
                    ],
                    "not_found": [
                        "Bon... On dirait que ta recherche ne donne aucun résultat. Je suis désolé %% :( ..."
                    ],
                    "fail": [
                        "Bon... l'API de Imgur a planté on dirait. Je suis désolé %% :( ..."
                    ]
                },
                "meme": {
                    "description": [
                        "Permet de générer un meme de type (type) avec le texte (top text) en haut et le texte (bottom text) en bas s'il a été renseigné"
                    ],
                    "parse_error": [
                        "Désolé %%, mais la commande n'a pas été écrite correctement, je ne comprends pas ce que tu me demandes."
                    ],
                    "not_found": [
                        "Désolé %%, mais ce type de meme n'existe pas... Tu devrais essayer !memelist pour avoir la liste des types de memes qui existent !"
                    ],
                    "fail": [
                        "Désolé %%, il semblerait que Imgflip ait planté..."
                    ]
                },
                "memelist": {
                    "description": [
                        "Je t'envoie en privé la liste des memes disponibles"
                    ],
                    "finished": [
                        "Je t'ai envoyé en privé la liste des memes disponibles %% !"
                    ]
                },
                "obf": {
                    "description": [
                        "Vous savez ce que ça donne, une phrase traduite successivement dans plusieurs langues ?"
                    ],
                    "wrong_language": [
                        "Désolé %%, je ne connais pas cette langue"
                    ],
                    "fail": [
                        "Désolé %%, on dirait que Google Traduction a planté :/ ..."
                    ],
                    "answer": [
                        "Voici ton texte après plusieurs traductions, %% :"
                    ]
                },
                "oed": {
                    "description": [
                        "Permet de récupérer une définition dans le Oxford English Dictionnary"
                    ],
                    "404": [
                        "Désolé %%, je n'ai pas trouvé le mot que tu recherches !"
                    ],
                    "fatal": [
                        "Désolé %%, on dirait que le service de Oxford English Dictionnary est planté :( ..."
                    ],
                    "fail": [
                        "Tu ne m'as pas donné le mot dont tu veux la définition, %% :| ..."
                    ]
                },
                "ping": {
                    "description": [
                        "Qui pour un ping pong ? Oh, pardon. Un tennis de table u_u"
                    ],
                    "answer": [
                        "%%, Pong !"
                    ]
                },
                "registerpermission": {
                    "description": [
                        "Permet d'autoriser ou interdire quelqu'un à l'utilisation d'une commande"
                    ],
                    "wrong_format": [
                        "%%, On a un souci. Je crois que tu as mal tapé la commande, du coup j'ai rien compris."
                    ],
                    "wrong_user": [
                        "%%, On a un souci. Je ne sais pas pour qui tu veux définir la permission, là. Il me faut l'id du membre, hein ? Au pire, identifie-le avec @, je me débrouillerai avec ça."
                    ],
                    "granted_parse_error": [
                        "%%, Tu veux donner ou retirer l'autorisation, là ? C'est pas vraiment clair..."
                    ],
                    "success": [
                        "%%, La permission a bien été créée :) !"
                    ],
                    "fail": [
                        "%%, Il y a eu une erreur durant la création, désolé :( ."
                    ]
                },
                "registerstaff": {
                    "description": [
                        "Permet d'enregistrer un membre du staff et de l'inscrire aux notifications de nouveau membre sur le serveur"
                    ],
                    "private_channel_error": [
                        "%%, j'ai besoin que tu exécutes cette commande sur un serveur pour que je puisse savoir duquel tu parles."
                    ],
                    "fail": [
                        "%%, il y a eu une erreur durant la sauvegarde, désolé :( ..."
                    ],
                    "success": [
                        "%%, le membre a bien été enregistré dans le staff et été inscrit aux notifications :) !"
                    ]
                },
                "scream": {
                    "description": [
                        "Je sais imiter pas mal de cris d'animaux"
                    ]
                },
                "setavatar": {
                    "description": [
                        "Permet de changer mon avatar"
                    ],
                    "network_error": [
                        "%%, La requête a échoué, t'es sûr que l'adresse est correcte ?"
                    ],
                    "fail": [
                        "%%, Le changement d'avatar n'a pas fonctionné, t'es sûr que c'est bien une image que tu m'as passé ?"
                    ],
                    "answer": [
                        "%%, Mon avatar a bien été changé :D !"
                    ]
                },
                "setlang": {
                    "description": [
                        "Vous permet de changer la langue dans laquelle je parle"
                    ],
                    "wrong_lang": [
                        "Je suis désolé, mais je ne connais pas cette langue..."
                    ],
                    "answer": [
                        "C'est bon, ma langue a bien été changée :) !"
                    ]
                },
                "setwelcomemessage": {
                    "description": [
                        "Permet de définir le message de bienvenue qui sera envoyé par message privé aux personnes qui rejoindront ce salon"
                    ],
                    "fail": [
                        "%%, Nope, ça n'a pas fonctionné : %%"
                    ],
                    "success": [
                        "%%, Compris, c'est dans la boîte !"
                    ]
                },
                "slots": {
                    "description": [
                        "Tu veux jouer aux machines à sous ? Bon, sauf que là y'a pas de sous."
                    ],
                    "try_again": [
                        "Essaie encore"
                    ],
                    "too_many_tries": [
                        "Tu as trop joué pour aujourd'hui, %%, reviens demain :D !"
                    ]
                },
                "unregisterpermission": {
                    "description": [
                        "Permet de supprimer une permission qui aurait au préalable été enregistrée"
                    ],
                    "wrong_format": [
                        "%%, On a un souci. Je crois que tu as mal tapé la commande, du coup j'ai rien compris."
                    ],
                    "wrong_user": [
                        "%%, On a un souci. Je ne sais pas pour qui tu veux retirer la permission, là. Il me faut l'id du membre, hein ? Au pire, identifie-le avec @, je me débrouillerai avec ça."
                    ],
                    "not_found": [
                        "%%, La permission que tu me demandes de supprimer n'existe déjà pas. J'imagine que c'est une bonne nouvelle, non ?"
                    ],
                    "success": [
                        "%%, La permission a bien été supprimée :) !"
                    ],
                    "fail": [
                        "%%, Il y a eu une erreur durant la suppression, désolé :/ ."
                    ]
                },
                "unregisterstaff": {
                    "description": [
                        "Permet de supprimer un membre du staff et des notifications de nouveau membre sur le serveur"
                    ],
                    "private_channel_error": [
                        "%%, J'ai besoin que tu exécutes cette commande sur un serveur pour que je puisse savoir duquel tu parles."
                    ],
                    "not_found": [
                        "%%, Le membre que tu veux supprimer du staff ne s'y trouve déjà pas, j'imagine que c'est une bonne nouvelle ?"
                    ],
                    "fail": [
                        "%%, Il y a eu une erreur durant la sauvegarde, désolé :/ ..."
                    ],
                    "success": [
                        "%%, Le membre a bien été supprimé du staff :) !"
                    ]
                },
                "wiki": {
                    "description": [
                        "Je peux rechercher un article sur Wikipédia et vous afficher le début ici si vous voulez"
                    ],
                    "fail": [
                        "Il semblerait que Wikipédia ait planté. Je ne pensais pas que ça arriverait un jour ! Désolé %% !"
                    ],
                    "not_found": [
                        "23 19, ON A UN 23 19 !! Ah non, c'est une 404, désolé. Enfin, la page demandée n'existe pas sur Wikipédia, quoi. Désolé, %% !"
                    ]
                },
                "youtube": {
                    "description": [
                        "Permet de rechercher une vidéo sur YouTube"
                    ],
                    "fail": [
                        "Bon... YouTube a l'air d'avoir planté, étrange... Je suis désolé %% :( ..."
                    ],
                    "error": [
                        "Bon... YouTube m'a retourné une erreur. Je pense qu'on a atteint le quota de recherches pour la journée ! Je suis désolé %% :( ..."
                    ],
                    "not_found": [
                        "Bon... YouTube n'a pas trouvé de résultat pour cette recherche. Je suis désolé %% :( ..."
                    ]
                }
            },
            "entity": {
                "permission": {
                    "register": {
                        "error_data_format": [
                            "Format de données incorrect"
                        ],
                        "error_sql_server_retrieval": [
                            "Le serveur SQL a retourné une erreur lors de la récupération"
                        ],
                        "error_sql_server_saving": [
                            "Le serveur SQL a retourné une erreur lors de l'enregistrement"
                        ]
                    },
                    "unregister": {
                        "error_data_format": [
                            "Format de données incorrect"
                        ],
                        "error_sql_server_retrieval": [
                            "Le serveur SQL a retourné une erreur lors de la récupération"
                        ],
                        "error_sql_server_deleting": [
                            "Le serveur SQL a retourné une erreur lors de la suppression"
                        ],
                        "error_404": [
                            "La permission en question n'existe pas"
                        ]
                    }
                }
            }
        },
        "utils": {
            "humanify": {
                "getimagedeliverysentence": {
                    "1": [
                        "Et voilà !"
                    ],
                    "2": [
                        "Eeeeeeeeet en voilà !"
                    ],
                    "3": [
                        "Tu aimes mon choix ?"
                    ],
                    "4": [
                        "J'ai trouvé ça !"
                    ],
                    "5": [
                        "Quelqu'un m'a chaudement recommandé ça. Je dirai pas qui c: ."
                    ]
                },
                "getchoicedeliverysentence": {
                    "1": [
                        "Je choisis %% !"
                    ],
                    "2": [
                        "Franchement, %%, sans hésiter."
                    ],
                    "3": [
                        "Tu rigoles ? Faut choisir %%, c'est évident !"
                    ],
                    "4": [
                        "C'est une grande responsabilité que de devoir faire ce choix. Mais je l'assume. Je choisis %%."
                    ]
                }
            },
            "yliasdiscordutils": {
                "getlocationstringfrommessage": {
                    "location_private": [
                        "C'était sur une conversation privée (date : %%)."
                    ],
                    "location_public": [
                        "C'était sur le serveur %% et sur le channel #%% (date : %%)."
                    ]
                }
            }
        }
    }
}